kleytonzotti/lvgl_porting/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-LCD-4.3B usa o modulo ESP32-S3-N16R8:
# 16MB Flash + 8MB PSRAM Octal. Config aqui e a mesma do demo oficial
# da Waveshare (ESP32-S3-Touch-LCD-4.3B-BOX-Demo/08_lvgl_Porting) para
# este chip; PSRAM em modo Quad/40M corrompe o framebuffer (fica na PSRAM
# e o painel RGB faz DMA continuo dela).
CONFIG_IDF_TARGET="esp32s3"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# BLE via NimBLE (app_ble)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Default (INFO) faz o host logar cada advertising/scan report continuamente
# no monitor serial; WARNING deixa so erros/avisos.
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
